# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [82]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [83]:
first = pd.Series(np.random.randint(1 , 5 , size = 100 ))
second = pd.Series(np.random.randint(1 ,4 , size = 100 ))
third = pd.Series(np.random.randint(10000 , 30001 , size = 100 ))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [84]:
df = pd.DataFrame({'First' : first , 'Second' : second , 'Third' : third})
df

    First  Second  Third
0       3       2  17889
1       2       2  20632
2       3       3  26817
3       1       2  23081
4       2       1  13310
..    ...     ...    ...
95      2       1  22181
96      3       3  13200
97      2       2  28095
98      1       1  18491
99      4       1  25744

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [85]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       3       2            17889
1       2       2            20632
2       3       3            26817
3       1       2            23081
4       2       1            13310
..    ...     ...              ...
95      2       1            22181
96      3       3            13200
97      2       2            28095
98      1       1            18491
99      4       1            25744

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [86]:
bigcolumn = pd.concat([first,second,third], axis=0)
bigcolumn

0         3
1         2
2         3
3         1
4         2
      ...
95    22181
96    13200
97    28095
98    18491
99    25744
Length: 300, dtype: int32

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [87]:
print(bigcolumn.index[-1])
print ('yes it is TRUE')

99
yes it is TRUE

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [88]:
bigcolumn.reset_index()

     index      0
0        0      3
1        1      2
2        2      3
3        3      1
4        4      2
..     ...    ...
295     95  22181
296     96  13200
297     97  28095
298     98  18491
299     99  25744

[300 rows x 2 columns]